my-to-do-list-api/app/controllers/tasks_controller.rb

        task = Task.create(task_params)
---
INSERT INTO "tasks" ("user_id", "title", "created_at", "updated_at", "dateToDo") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["title", "Santoni"], ["created_at", "2020-05-29 12:46:35.615355"], ["updated_at", "2020-05-29 12:46:35.615355"], ["dateToDo", "2020-05-29"]]

        task = Task.find(params[:id])

        task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", true], ["updated_at", "2020-05-29 13:26:23.468036"], ["id", 3]]