my-to-do-list-api/app/controllers/users_controller.rb

    def index
        # users = User.all.sort_by { |user| user.username }
        users = User.all
---
SELECT "users".* FROM "users"